app/controllers/hotel/profiles_controller.rb

  def update
    @hotel = current_hotel
    authorize @hotel

    if @hotel.update(hotel_params)
---
UPDATE "hotels" SET "name" = $1, "address" = $2, "star_rating" = $3, "updated_at" = $4 WHERE "hotels"."id" = $5  [["name", "Updated Hotel Name"], ["address", "123 New Street"], ["star_rating", 5], ["updated_at", "2026-03-25 05:07:34.577569"], ["id", 12]]