app/controllers/public/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'superadmin@wastays.com' LIMIT 1