app/controllers/application_controller.rb

SELECT "hotels".* FROM "hotels" INNER JOIN "user_hotel_accesses" ON "hotels"."id" = "user_hotel_accesses"."hotel_id" WHERE "user_hotel_accesses"."user_id" = 1 ORDER BY "hotels"."id" ASC LIMIT 1
---
  def current_hotel
    @current_hotel ||= if params[:hotel_id]
      current_user.hotels.find_by(id: params[:hotel_id])
    else
      current_user.hotels.first